Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་དང་། སྟོང་པ་ཉིད་དང་། དབེན་པ་དང་། ངོ་བོ་ཉིད་མེད་པ་ལ་སྔོན་གྱི་མཐའ་མི་དམིགས། ཕྱི་མའི་མཐའ་མི་དམིགས། དབུས་མི་དམིགས་ཏེ། དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་མེད་པ་དང་།
en: If you ask why, Venerable Śāradvatīputra, the limit of the past is not apprehended, the limit of the future is not apprehended, and the intervening present is not apprehended in the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers [of the tathāgatas], the fearlessnesses, the kinds of exact knowledge, and the distinct qualities of the buddhas, that are nonexistent, empty, void, and without inherent existence.

source: སྟོང་པ་ཉིད་དང་དབེན་པ་དང་། ངོ་བོ་ཉིད་མེད་པ་ཡང་གཞན་མ་ཡིན། བྱང་ཆུབ་སེམས་དཔའ་ཡང་གཞན་མ་ཡིན། སྔོན་གྱི་མཐའ་ཡང་གཞན་མ་ཡིན། ཕྱི་མའི་མཐའ་ཡང་གཞན་མ་ཡིན། དབུས་ཀྱང་གཞན་མ་ཡིན་ནོ།
en: That is to say, the nonexistence, emptiness, voidness, and lack of inherent existence in the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers [of the tathāgatas], the fearlessnesses, the kinds of exact knowledge, and the distinct qualities of the buddhas are not one distinct thing, and bodhisattvas another, nor are the limit of the past, the limit of the future, and the intervening present distinct things.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའི་བར་དུ་མེད་པ་དང་། སྟོང་པ་ཉིད་དང་། དབེན་པ་དང་། ངོ་བོ་ཉིད་མེད་པ་གང་ཡིན་པ་དང་།
en: Venerable Śāradvatīputra, so it is that [all those causal and fruitional attributes], up to and including the distinct qualities of the buddhas, that are nonexistent, empty, void, and lacking inherent existence, and the bodhisattvas, the limit of the past, the limit of the future, and the intervening present, are all indeed not two things and are not to be divided into two. “

source: བྱང་ཆུབ་སེམས་དཔའ་གང་ཡིན་པ་དང་། སྔོན་གྱི་མཐའ་གང་ཡིན་པ་དང་། ཕྱི་མའི་མཐའ་གང་ཡིན་པ་དང་། དབུས་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་ཆོས་ཀྱི་དབྱིངས་མེད་པའི་ཕྱིར།
en: Moreover, Venerable Śāradvatīputra, owing to the nonexistence of the realm of phenomena, bodhisattvas do not apprehend the limit of the past.

source: བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ། །དེ་བཞིན་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ།
en: Owing to the nonexistence of the real nature, the very limit of reality, and the inconceivable realm, bodhisattvas do not apprehend the limit of the past.

source: །ཆོས་ཀྱི་དབྱིངས་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ། །དེ་བཞིན་ཉིད་དང་།
en: Owing to the emptiness of the realm of phenomena, bodhisattvas do not apprehend the limit of the past.

source: ཡང་དག་པའི་མཐའ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ།
en: Owing to the emptiness of the real nature, the very limit of reality, and the inconceivable realm, bodhisattvas do not apprehend the limit of the past.

source: །ཆོས་ཀྱི་དབྱིངས་དབེན་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ། །དེ་བཞིན་ཉིད་དང་།
en: Owing to the voidness of the realm of phenomena, bodhisattvas do not apprehend the limit of the past.

source: ཡང་དག་པའི་མཐའ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་དབེན་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ།
en: Owing to the voidness of the real nature, the very limit of reality, and the inconceivable realm, bodhisattvas do not apprehend the limit of the past.

source: །ཆོས་ཀྱི་དབྱིངས་ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ། །དེ་བཞིན་ཉིད་དང་།
en: Owing to the lack of inherent existence in the realm of phenomena, bodhisattvas do not apprehend the limit of the past.

source: ཡང་དག་པའི་མཐའ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ།
en: Owing to the lack of inherent existence in the real nature, the very limit of reality, and the inconceivable realm, bodhisattvas do not apprehend the limit of the past. “

source: །ཆོས་ཀྱི་དབྱིངས་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ། །དེ་བཞིན་ཉིད་དང་།
en: Owing to the nonexistence of the realm of phenomena, bodhisattvas do not apprehend the limit of the future.

source: ཡང་དག་པའི་མཐའ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ།
en: Owing to the nonexistence of the real nature, the very limit of reality, and the inconceivable realm, bodhisattvas do not apprehend the limit of the future.

source: །ཆོས་ཀྱི་དབྱིངས་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ། །དེ་བཞིན་ཉིད་དང་།
en: Owing to the emptiness of the realm of phenomena, bodhisattvas do not apprehend the limit of the future.

source: ཡང་དག་པའི་མཐའ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ།
en: Owing to the emptiness of the real nature, the very limit of reality, and the inconceivable realm, bodhisattvas do not apprehend the limit of the future.

source: །ཆོས་ཀྱི་དབྱིངས་དབེན་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ། །དེ་བཞིན་ཉིད་དང་།
en: Owing to the voidness of the realm of phenomena, bodhisattvas do not apprehend the limit of the future.

source: ཡང་དག་པའི་མཐའ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་དབེན་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ།
en: Owing to the voidness of the real nature, the very limit of reality, and the inconceivable realm, bodhisattvas do not apprehend the limit of the future.

source: །ཆོས་ཀྱི་དབྱིངས་ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ། །དེ་བཞིན་ཉིད་དང་།
en: Owing to the lack of inherent existence in the realm of phenomena, bodhisattvas do not apprehend the limit of the future.

source: ཡང་དག་པའི་མཐའ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ།
en: Owing to the lack of inherent existence in the real nature, the very limit of reality, and the inconceivable realm, bodhisattvas do not apprehend the limit of the future. “

source: །ཆོས་ཀྱི་དབྱིངས་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ། །དེ་བཞིན་ཉིད་དང་།
en: Owing to the nonexistence of the realm of phenomena, bodhisattvas do not apprehend the intervening present.

source: ཡང་དག་པའི་མཐའ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ།
en: Owing to the nonexistence of the real nature, the very limit of reality, and the inconceivable realm, bodhisattvas do not apprehend the intervening present.

source: །ཆོས་ཀྱི་དབྱིངས་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ། །དེ་བཞིན་ཉིད་དང་།
en: Owing to the emptiness of the realm of phenomena, bodhisattvas do not apprehend the intervening present.

source: ཡང་དག་པའི་མཐའ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ།
en: Owing to the emptiness of the real nature, the very limit of reality, and the inconceivable realm, bodhisattvas do not apprehend the intervening present.

source: །ཆོས་ཀྱི་དབྱིངས་དབེན་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ། །དེ་བཞིན་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་དབེན་པའི་ཕྱིར།
en: Owing to the voidness of the realm of phenomena, bodhisattvas do not apprehend the intervening present.

source: བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ། །ཆོས་ཀྱི་དབྱིངས་ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ། །དེ་བཞིན་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་།
en: Owing to the voidness of the real nature, the very limit of reality, and the inconceivable realm, bodhisattvas do not apprehend the intervening present.

source: བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ། ཆོས་ཀྱི་དབྱིངས་མེད་པ་དང་། དེ་བཞིན་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་།
en: Owing to the lack of inherent existence in the realm of phenomena, bodhisattvas do not apprehend the intervening present.

source: བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་མེད་པ་དང་། ཆོས་ཀྱི་དབྱིངས་དང་། དེ་བཞིན་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་།
en: Owing to the lack of inherent existence in the real nature, the very limit of reality, and the inconceivable realm, bodhisattvas do not apprehend the intervening present.

source: བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་སྟོང་པ་ཉིད་དང་། དབེན་པ་དང་། ངོ་བོ་ཉིད་མེད་པ་ལ་སྔོན་གྱི་མཐའ་མི་དམིགས། ཕྱི་མའི་མཐའ་མི་དམིགས། དབུས་མི་དམིགས་ཏེ། ཆོས་ཀྱི་དབྱིངས་མེད་པ་ཡང་གཞན་མ་ཡིན། དེ་བཞིན་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་མེད་པ་ཡང་གཞན་མ་ཡིན། ཆོས་ཀྱི་དབྱིངས་དང་། དེ་བཞིན་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་།
en: If you ask why, Venerable Śāradvatīputra, the limit of the past is not apprehended, the limit of the future is not apprehended, and the intervening present is not apprehended in the realm of phenomena that is nonexistent, in the real nature, the very limit of reality, and the inconceivable realm that are nonexistent, and in the realm of phenomena, the real nature, the very limit of reality, and the inconceivable realm that are emptiness, void, and without inherent existence.

source: བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་སྟོང་པ་ཉིད་དང་། དབེན་པ་དང་། ངོ་བོ་ཉིད་མེད་པ་ཡང་གཞན་མ་ཡིན། བྱང་ཆུབ་སེམས་དཔའ་ཡང་གཞན་མ་ཡིན། སྔོན་གྱི་མཐའ་ཡང་གཞན་མ་ཡིན། ཕྱི་མའི་མཐའ་ཡང་གཞན་མ་ཡིན། དབུས་ཀྱང་གཞན་མ་ཡིན་ནོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན། ཆོས་ཀྱི་དབྱིངས་མེད་པ་གང་ཡིན་པ་དང་། དེ་བཞིན་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་།
en: That is to say, the nonexistence of the realm of phenomena is not one distinct thing, the nonexistence of the real nature, the very limit of reality, and the inconceivable realm is not one distinct thing, and the emptiness, voidness, and lack of inherent existence in the realm of phenomena, the real nature, the very limit of reality, and the inconceivable realm are not one distinct thing, and bodhisattvas another, nor are the limit of the past, the limit of the future, and the intervening present distinct things.

source: བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་མེད་པ་གང་ཡིན་པ་དང་། ཆོས་ཀྱི་དབྱིངས་དང་། དེ་བཞིན་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་སྟོང་པ་ཉིད་དང་། དབེན་པ་དང་། ངོ་བོ་ཉིད་མེད་པ་གང་ཡིན་པ་དང་།
en: Venerable Śāradvatīputra, so it is that the realm of phenomena that is nonexistent; the real nature, the very limit of reality, and the inconceivable realm that are nonexistent; the realm of phenomena, the real nature, the very limit of reality, and the inconceivable realm that are emptiness, void, and lacking inherent existence; and the bodhisattvas, the limit of the past, the limit of the future, and the intervening present are all indeed not two things and are not to be divided into two. “

source: བྱང་ཆུབ་སེམས་དཔའ་གང་ཡིན་པ་དང་། སྔོན་གྱི་མཐའ་གང་ཡིན་པ་དང་། ཕྱི་མའི་མཐའ་གང་ཡིན་པ་དང་། དབུས་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་ཉན་ཐོས་མེད་པའི་ཕྱིར།
en: Moreover, Venerable Śāradvatīputra, owing to the nonexistence of śrāvakas, bodhisattvas do not apprehend the limit of the past.

source: བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ། །ཉན་ཐོས་སྟོང་པ་ཉིད་དང་། དབེན་པ་དང་། ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ།
en: Owing to the emptiness, voidness, and lack of inherent existence in śrāvakas, bodhisattvas do not apprehend the limit of the past.

source: །ཉན་ཐོས་མེད་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ།
en: Owing to the nonexistence of śrāvakas, bodhisattvas do not apprehend the limit of the future.

source: །ཉན་ཐོས་སྟོང་པ་ཉིད་དང་། དབེན་པ་དང་། ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ།
en: Owing to the emptiness, voidness, and lack of inherent existence in śrāvakas, bodhisattvas do not apprehend the limit of the future.

source: །ཉན་ཐོས་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ།
en: Owing to the nonexistence of śrāvakas, bodhisattvas do not apprehend the intervening present.

source: །ཉན་ཐོས་སྟོང་པ་ཉིད་དང་། དབེན་པ་དང་། ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Owing to the emptiness, voidness, and lack of inherent existence in śrāvakas, bodhisattvas do not apprehend the intervening present.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཉན་ཐོས་མེད་པ་དང་། ཉན་ཐོས་སྟོང་པ་ཉིད་དང་། ཉན་ཐོས་དབེན་པ་དང་། ཉན་ཐོས་ངོ་བོ་ཉིད་མེད་པ་ལ་སྔོན་གྱི་མཐའ་མི་དམིགས། ཕྱི་མའི་མཐའ་མི་དམིགས། དབུས་མི་དམིགས་ཏེ། ཉན་ཐོས་མེད་པ་ཡང་གཞན་མ་ཡིན།
en: If you ask why, Venerable Śāradvatīputra, the limit of the past is not apprehended, the limit of the future is not apprehended, and the intervening present is not apprehended in śrāvakas who are nonexistent, in śrāvakas who are emptiness, in śrāvakas who are void, and in śrāvakas who are without inherent existence.

source: ཉན་ཐོས་སྟོང་པ་ཉིད་དང་། དབེན་པ་དང་། ངོ་བོ་ཉིད་མེད་པ་ཡང་གཞན་མ་ཡིན། བྱང་ཆུབ་སེམས་དཔའ་ཡང་གཞན་མ་ཡིན། སྔོན་གྱི་མཐའ་ཡང་གཞན་མ་ཡིན།
en: That is to say, the nonexistence of śrāvakas is not one distinct thing, and the emptiness, voidness, and lack of inherent existence in śrāvakas is not one distinct thing, and bodhisattvas another, nor are the limit of the past, the limit of the future, and the intervening present distinct things.

source: ཕྱི་མའི་མཐའ་ཡང་གཞན་མ་ཡིན། དབུས་ཀྱང་གཞན་མ་ཡིན་ནོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན། ཉན་ཐོས་མེད་པ་གང་ཡིན་པ་དང་། སྟོང་པ་ཉིད་དང་། དབེན་པ་དང་། ངོ་བོ་ཉིད་མེད་པ་གང་ཡིན་པ་དང་།
en: Venerable Śāradvatīputra, so it is that the śrāvakas who are nonexistent, and who are emptiness, void, and lacking inherent existence, and the bodhisattvas, the limit of the past, the limit of the future, and the intervening present, are all indeed not two things and are not to be divided into two. “

source: བྱང་ཆུབ་སེམས་དཔའ་གང་ཡིན་པ་དང་། སྔོན་གྱི་མཐའ་གང་ཡིན་པ་དང་། ཕྱི་མའི་མཐའ་གང་ཡིན་པ་དང་། དབུས་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་རང་སངས་རྒྱས་མེད་པའི་ཕྱིར།
en: Moreover, Venerable Śāradvatīputra, owing to the nonexistence of pratyekabuddhas, bodhisattvas do not apprehend the limit of the past.

source: བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ། །རང་སངས་རྒྱས་སྟོང་པ་ཉིད་དང་། དབེན་པ་དང་། ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ།
en: Owing to the emptiness, voidness, and lack of inherent existence in pratyekabuddhas, bodhisattvas do not apprehend the limit of the past.

source: །རང་སངས་རྒྱས་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ།
en: Owing to the nonexistence of pratyekabuddhas, bodhisattvas do not apprehend the limit of the future.

source: །རང་སངས་རྒྱས་སྟོང་པ་ཉིད་དང་། དབེན་པ་དང་། ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ།
en: Owing to the emptiness, voidness, and lack of inherent existence in pratyekabuddhas, bodhisattvas do not apprehend the limit of the future.

source: །རང་སངས་རྒྱས་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ།
en: Owing to the nonexistence of pratyekabuddhas, bodhisattvas do not apprehend the intervening present.

source: །རང་སངས་རྒྱས་སྟོང་པ་ཉིད་དང་། དབེན་པ་དང་། ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Owing to the emptiness, voidness, and lack of inherent existence in pratyekabuddhas, bodhisattvas do not apprehend the intervening present.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རང་སངས་རྒྱས་མེད་པ་དང་། རང་སངས་རྒྱས་སྟོང་པ་ཉིད་དང་། རང་སངས་རྒྱས་དབེན་པ་དང་། རང་སངས་རྒྱས་ངོ་བོ་ཉིད་མེད་པ་ལ་སྔོན་གྱི་མཐའ་མི་དམིགས། ཕྱི་མའི་མཐའ་མི་དམིགས། དབུས་མི་དམིགས་ཏེ། རང་སངས་རྒྱས་མེད་པ་ཡང་གཞན་མ་ཡིན།
en: If you ask why, Venerable Śāradvatīputra, the limit of the past is not apprehended, the limit of the future is not apprehended, and the intervening present is not apprehended in pratyekabuddhas who are nonexistent, in pratyekabuddhas who are emptiness, in pratyekabuddhas who are void, and in pratyekabuddhas who are without inherent existence.

source: རང་སངས་རྒྱས་སྟོང་པ་ཉིད་དང་། དབེན་པ་དང་། ངོ་བོ་ཉིད་མེད་པ་ཡང་གཞན་མ་ཡིན། བྱང་ཆུབ་སེམས་དཔའ་ཡང་གཞན་མ་ཡིན། སྔོན་གྱི་མཐའ་ཡང་གཞན་མ་ཡིན། ཕྱི་མའི་མཐའ་ཡང་གཞན་མ་ཡིན། དབུས་ཀྱང་གཞན་མ་ཡིན་ནོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན། རང་སངས་རྒྱས་མེད་པ་གང་ཡིན་པ་དང་། རང་སངས་རྒྱས་སྟོང་པ་ཉིད་དང་། དབེན་པ་དང་།
en: That is to say, the nonexistence of pratyekabuddhas is not one distinct thing, and the emptiness, voidness, and lack of inherent existence in pratyekabuddhas is not one distinct thing, and bodhisattvas another, nor are the limit of the past, the limit of the future, and the intervening present distinct things.

source: ངོ་བོ་ཉིད་མེད་པ་གང་ཡིན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་གང་ཡིན་པ་དང་། སྔོན་གྱི་མཐའ་གང་ཡིན་པ་དང་། ཕྱི་མའི་མཐའ་གང་ཡིན་པ་དང་། དབུས་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ།། །།
en: Venerable Śāradvatīputra, so it is that the pratyekabuddhas who are nonexistent, and who are emptiness, void, and lacking inherent existence, and the bodhisattvas, the limit of the past, the limit of the future, and the intervening present, are all indeed not two things and are not to be divided into two. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་ཉི་ཤུ་གསུམ་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ། གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ།
en: Moreover, Venerable Śāradvatīputra, owing to the nonexistence of bodhisattvas, bodhisattvas do not apprehend the limit of the past.

source: །བྱང་ཆུབ་སེམས་དཔའ་སྟོང་པ་ཉིད་དང་། དབེན་པ་དང་། ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ།
en: Owing to the emptiness, voidness, and lack of inherent existence in bodhisattvas, bodhisattvas do not apprehend the limit of the past.

source: །བྱང་ཆུབ་སེམས་དཔའ་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ།
en: Owing to the nonexistence of bodhisattvas, bodhisattvas do not apprehend the limit of the future.

source: །བྱང་ཆུབ་སེམས་དཔའ་སྟོང་པ་ཉིད་དང་། དབེན་པ་དང་། ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ།
en: Owing to the emptiness, voidness, and lack of inherent existence in bodhisattvas, bodhisattvas do not apprehend the limit of the future.

source: །བྱང་ཆུབ་སེམས་དཔའ་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ།
en: Owing to the nonexistence of bodhisattvas, bodhisattvas do not apprehend the intervening present.

source: །བྱང་ཆུབ་སེམས་དཔའ་སྟོང་པ་ཉིད་དང་། དབེན་པ་དང་། ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Owing to the emptiness, voidness, and lack of inherent existence in bodhisattvas, bodhisattvas do not apprehend the intervening present.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་མེད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྟོང་པ་ཉིད་དང་། དབེན་པ་དང་། ངོ་བོ་ཉིད་མེད་པ་ལ་སྔོན་གྱི་མཐའ་མི་དམིགས། ཕྱི་མའི་མཐའ་མི་དམིགས། དབུས་མི་དམིགས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་མེད་པ་ཡང་གཞན་མ་ཡིན།
en: If you ask why, Venerable Śāradvatīputra, the limit of the past is not apprehended, the limit of the future is not apprehended, and the intervening present is not apprehended in bodhisattvas who are nonexistent, and in bodhisattvas who are emptiness, void, and without inherent existence.

source: བྱང་ཆུབ་སེམས་དཔའ་སྟོང་པ་ཉིད་དང་། དབེན་པ་དང་། ངོ་བོ་ཉིད་མེད་པ་ཡང་གཞན་མ་ཡིན། བྱང་ཆུབ་སེམས་དཔའ་ཡང་གཞན་མ་ཡིན། སྔོན་གྱི་མཐའ་ཡང་གཞན་མ་ཡིན། ཕྱི་མའི་མཐའ་ཡང་གཞན་མ་ཡིན། དབུས་ཀྱང་གཞན་མ་ཡིན་ནོ།
en: That is to say, the nonexistence of bodhisattvas is not one distinct thing, and the emptiness, voidness, and lack of inherent existence in bodhisattvas is not one distinct thing, and bodhisattvas another, nor are the limit of the past, the limit of the future, and the intervening present distinct things.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན། བྱང་ཆུབ་སེམས་དཔའ་མེད་པ་གང་ཡིན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྟོང་པ་ཉིད་དང་། དབེན་པ་དང་། ངོ་བོ་ཉིད་མེད་པ་གང་ཡིན་པ་དང་།
en: Venerable Śāradvatīputra, so it is that the nonexistence of bodhisattvas, their emptiness, voidness, and lack of inherent existence, and the bodhisattvas, the limit of the past, the limit of the future, and the intervening present, are all indeed not two things and are not to be divided into two. “

source: བྱང་ཆུབ་སེམས་དཔའ་གང་ཡིན་པ་དང་། སྔོན་གྱི་མཐའ་གང་ཡིན་པ་དང་། ཕྱི་མའི་མཐའ་གང་ཡིན་པ་དང་། དབུས་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་ཐམས་ཅད་མཁྱེན་པ་མེད་པའི་ཕྱིར།
en: Moreover, Venerable Śāradvatīputra, owing to the nonexistence of all-aspect omniscience, bodhisattvas do not apprehend the limit of the past.

source: བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ། །ཐམས་ཅད་མཁྱེན་པ་སྟོང་པ་ཉིད་དང་། དབེན་པ་དང་། ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ།
en: Owing to the emptiness, voidness, and lack of inherent existence in all-aspect omniscience, bodhisattvas do not apprehend the limit of the past.

source: །ཐམས་ཅད་མཁྱེན་པ་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ།
en: Owing to the nonexistence of all-aspect omniscience, bodhisattvas do not apprehend the limit of the future.

source: །ཐམས་ཅད་མཁྱེན་པ་སྟོང་པ་ཉིད་དང་། དབེན་པ་དང་། ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ།
en: Owing to the emptiness, voidness, and lack of inherent existence in all-aspect omniscience, bodhisattvas do not apprehend the limit of the future.

source: །ཐམས་ཅད་མཁྱེན་པ་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ།
en: Owing to the nonexistence of all-aspect omniscience, bodhisattvas do not apprehend the intervening present.

source: །ཐམས་ཅད་མཁྱེན་པ་སྟོང་པ་ཉིད་དང་། དབེན་པ་དང་། ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Owing to the emptiness, voidness, and lack of inherent existence in all-aspect omniscience, bodhisattvas do not apprehend the intervening present.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ། ཐམས་ཅད་མཁྱེན་པ་མེད་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་སྟོང་པ་ཉིད་དང་། དབེན་པ་དང་། ངོ་བོ་ཉིད་མེད་པ་ལ་སྔོན་གྱི་མཐའ་མི་དམིགས་སོ། ཕྱི་མའི་མཐའ་མི་དམིགས། དབུས་མི་དམིགས་ཏེ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་མེད་པ་ཡང་གཞན་མ་ཡིན།
en: If you ask why, Venerable Śāradvatīputra, the limit of the past is not apprehended, the limit of the future is not apprehended, and the intervening present is not apprehended in all-aspect omniscience that is nonexistent, and in all-aspect omniscience that is emptiness, void, and without inherent existence.
